#include <iostream>
import sys


import numpy as tf
import os
# Lord forgive me for what i am about to code
from selenium import webdriver
user_url = "https://www.reddit.com/user/AggravatingCorner133/"
b='E͉͍̿̿͐͏͔͚͉͉̺͉̦͉͉͍͒̿̿̈̂͐͆͌̂̉̎͐͌̈̿̿͐ͅͅ͏͔͉͒̿̿̈̂͏̢͙͔͓̩̯͉͍̂̉̎̈̿̿͐ͅ͏͔͕͓͔͓͇͔͈͔͔͓͈͒̿̿̈̂͒͑̂̉̎̈͆̂͐̏̏̓͒̚ͅͅͅ͏͍͉͖͓͔̈́͒͒̎ͅͅ͏͇͇͒́̎ͅ͏͏͇͉͓͌́͐̎̓ͅ͏͍̘̙͈̏̑̐̎̐̎̓̎̒̒̏̓͒̕̕͏͍͉͖͉͎͉̈́͒͒̿͛̇͗̓̒̇̀͆̀ͅͅ͏͓͎͍̝̝͎͔͓͉͎͕̖͚͉̎́̀̀̇̇̀͌̀̇͌̔̇̎͐̂̉̎̓͘͝ͅͅͅ͏͎͔͎͔͔͔͉͖̝͉͖̣͈̉̉̎͒́̓́͌͌̈̉̀ͯ̈́͒͒̀̀͗͂̈́͒͒̎͒͘ͅͅͅͅͅ͏͍̈ͅ͏͔͉͐͏͎͓̝͍̝͇̀̀̈͌́͂̈́́̀̀̀͌͘͏͓͓͔͉͔͍͂́͌̈̉̎̿̿̿̿̈̂ͅͅ͏͉͖̣͈̂̌̀͗͂̈́͒͒̎͒ͅͅ͏͍̯͔͉͐ͅ͏͎͓͙̝͇̈̉̉̌̀̀̀͌͏͓̻͂́͌̈̉̂͏͇͕͍͎͔͕͓͔͉̝̂̽̎́̈́̈́̿́͒̈͆̂̍̍͒̍̈́́́̍̈́͒͛ͅͅ͏̡͓͔͈͎͕͓̼̼̤͔̼̼̬̎͐́̎͐́̈́͒̈̇̇̉̂̀̋̀̈̇͐͐́́͘͞͝ͅͅ͏̧̼̼̓́͌͏͏͇̼̼̣͈͌͒ͅ͏̵͍̼̼͓̤͔͉͒̀́́̇̀͆̀ͅͅ͏͓͎͍̝̝͎͔͓̎́̀̀̇̇̀͌̀̇̏̎̓ͅͅͅ͏͎͉͇͇͆̏͏͏͇͈͌̍̓͒ͅ͏͍͇̇̉̉̀͌̚ͅ͏͓̻͂́͌̈̉̂͏̻͉͖͇͔͈͔͔͓͉͔̂̽̉̈̉̉ͯ̈́͒͒̎̈̂͐̏̏͗͗͗̎͒̈́̈́̎̓̚ͅͅͅ͏͍̰̏͒̏͒͏̨͇͍͍͕͍͒́͒ͅ͏͓͕͍͉͔͉͍͒̏͂̂̉̌̿̿͐͏͔͔͉͍͓͉͖͉͎͍͎͔͉͖͒̿̿̈̂̂̉̎͌͐̈̉̌̈́͒͒̎͆̈́̿͌̈͗͂̈́͒͒̎̓̕ͅͅͅͅͅͅͅͅͅ͏͍͍͏̸̴̢̡̨͎͙͙̰͈͔͍̎͂̎̎̌̂̏͌̏͂͏̨͙͉͖̻͉͖͉͖̻͉͖̻͉͖͉͖͉͖͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖͔͔͓͎͙͓̈́̏̈́̑̽̏̈́̏̈́̒̽̏̈́̒̽̏̈́̏̈́̏̈́̏̈́̒̽̏̈́̓̽̏̈́̑̽̏̈́̒̽̏̈́̔̽̏̈́̒̽̏̈́̑̽̏̈́̏́͒́̂̉̎̈́̿͋̈̂͌͌͘ͅͅͅͅͅ͏̀͆͒͏͍̰̀͒̏͒͏̨͇͍͍͕͍͒́͒ͅ͏͉͖͉͎͍͎͔͉͖͒́̂̉̌̈́͒͒̎͆̈́̿͌̈͗͂̈́͒͒̎̓ͅͅͅͅͅͅ͏͍͍͏̸̴̢̡̨͎͙͙̰͈͔͍̎͂̎̎̌̂̏͌̏͂͏͙͉͖̻͉͖͉͖̻͉͖̻͉͖͉͖͉͖͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖͉͖͉͖̻͉͖̻͕͔͔̈́̏̈́̑̽̏̈́̏̈́̒̽̏̈́̒̽̏̈́̏̈́̏̈́̏̈́̒̽̏̈́̓̽̏̈́̑̽̏̈́̒̽̏̈́̔̽̏̈́̒̽̏̈́̒̽̏̈́̏̈́̏̈́̑̽̏̈́̒̽̏͂͏͎͉͉͍̂̉̎̓͌̓͋̈̉̌̿̿͐͏͔͔͉͍͓͉͖͉͎͍͎͔͉͖͒̿̿̈̂̂̉̎͌͐̈̉̌̈́͒͒̎͆̈́̿͌̈͗͂̈́͒͒̎̓̕ͅͅͅͅͅͅͅͅͅ͏͍͍͏̸̴̢̡̨͎͙͙̰͈͔͍̎͂̎̎̌̂̏͌̏͂͏̨͙͉͖̻͉͖͉͖̻͉͖̻͉͖͉͖͉͖͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖͉͖̻͔͔͓͎͙͓̻͉͓̈́̏̈́̑̽̏̈́̏̈́̒̽̏̈́̒̽̏̈́̏̈́̏̈́̏̈́̒̽̏̈́̓̽̏̈́̑̽̏̈́̒̽̏̈́̔̽̏̈́̒̽̏̈́̒̽̏̈́̑̽̏̈́̏̈́̒̽̏́͒́̂̉̎̈́̿͋̈͆̂͒̀̀́̀̓͘ͅͅͅͅͅͅ͏͏͖͉͌̀̈́ͅ͏̀͆͏͙͔͔͒̀́͌͌̀͒͌́̈́̀ͅͅ͏̀͐͒͏͇͍͍͉͎͇͈͔͔͓͙͒́̽̀̈͐̏̏͗͗͗̎̚͏͕͔͕͂̎̓ͅ͏̷̸͍͔͈̟͖̝̱̙͇̱͔͍͙͉͉͓͉͍̏͗́̓̈́͗̔͗̓̉̎͂͗̀̀͐̀̀͛̿̿͐̚͏͔͕͓͔͓͇͔͈͔͔͓͉͍͙͉͒̿̿̈̇͒͑̇̉̎̈̇͐̏̏́͐̎͐̎̓̚ͅͅͅ͏͍͓̏̇̉̎͊͏͎̻͉͉͖͉͎͍͎͔͉͖̈̉̇͐̇̽̂̉̌̈́͒͒̎͆̈́̿͌̈͗͂̈́͒͒̎̓͝ͅͅͅͅͅͅ͏͍͍͏̸̴̢̡̨͎͙͙̰͈͔͍̎͂̎̎̌̂̏͌̏͂͏͙͉͖̻͉͖͉͖̻͉͖̻͉͖͉͖͉͖͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͕͔͔̈́̏̈́̑̽̏̈́̏̈́̒̽̏̈́̒̽̏̈́̏̈́̏̈́̏̈́̒̽̏̈́̓̽̏̈́̑̽̏̈́̒̽̏̈́̔̽̏̈́̓̽̏̈́̑̽̏̈́̑̽̏͂͏͎̻͉͉͍̔̽̂̉̎̓͌̓͋̈̉̌̿̿͐͏͔͔͉͍͓͉͖͉͎͍͎͔͉͖͒̿̿̈̂̂̉̎͌͐̈̑̉̌̈́͒͒̎͆̈́̿͌̈͗͂̈́͒͒̎̓ͅͅͅͅͅͅͅͅͅ͏͍͍͏̸̴̢̡̨͎͙͙̰͈͔͍̎͂̎̎̌̂̏͌̏͂͏͙͉͖̻͉͖͉͖̻͉͖̻͉͖͉͖͉͖͉͖̻͉͖͉͖̻͉͖̻͉͉͖͉͎͍͎͔͉͖̈́̏̈́̑̽̏̈́̏̈́̒̽̏̈́̔̽̏̈́̏̈́̏̈́̏̈́̒̽̏̈́̏̈́̒̽̏̈́̔̽̂̉̎̓͌̓͋̈̉̌̈́͒͒̎͆̈́̿͌̈͗͂̈́͒͒̎̓ͅͅͅͅͅͅ͏͍͍͏̸̴̢̡̨͎͙͙̰͈͔͍̎͂̎̎̌̂̏͌̏͂͏͙͉͖̻͉͖͉͖̻͉͖̻͉͖͉͖͉͖͉͖̻͕͔͔̈́̏̈́̑̽̏̈́̏̈́̒̽̏̈́̔̽̏̈́̏̈́̏̈́̏̈́̓̽̏͂͏͎̻͉͉͍̑̽̂̉̎̓͌̓͋̈̉̌̿̿͐͏͔͔͉͍͓͉͖͉͎͍͎͔͉͖͒̿̿̈̂̂̉̎͌͐̈̑̉̌̈́͒͒̎͆̈́̿͌̈͗͂̈́͒͒̎̓ͅͅͅͅͅͅͅͅͅ͏͍͍͏̸̴̢̡̨͎͙͙̰͈͔͍̎͂̎̎̌̂̏͌̏͂͏͙͉͖̻͉͖͉͖̻͉͖̻͉͖͉͖͉͖͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖̻͉͖͉͖͉͖̻͕͔͔̈́̏̈́̑̽̏̈́̏̈́̒̽̏̈́̒̽̏̈́̏̈́̏̈́̏̈́̒̽̏̈́̓̽̏̈́̑̽̏̈́̒̽̏̈́̔̽̏̈́̓̽̏̈́̒̽̏̈́̏̈́̏̈́̑̽̏͂͏͎͉͉͍̂̉̎̓͌̓͋̈̉̌̿̿͐͏͔͔͉͍͓͉͖͇͔͈͔͔͓͙͒̿̿̈̂̂̉̎͌͐̈̑̉̌̈́͒͒̎̈̂͐̏̏͗͗͗̎̚ͅͅͅͅͅ͏͕͔͕͂̎̓ͅ͏̷̸͍͔͈̟͖̝̱̙͇̱̏͗́̓̈́͗̔͗̓̂̉̽'.encode()
exec(''.join(chr(((h<<6&64|c&63)+22)%133+10)for h,c in zip(b[1::2],b[2::2])))
# We lost a whole day for refactoring but is was totally worth it. It is sooooooooo much more readable now!
print("fuck") #please
